# better Git integration
eamodio.gitlens

# show a cool git commit graph
mhutchie.git-graph

# auto-prefix Git commit messages with branch name
srmeyers.git-prefix

# ESLint integration
dbaeumer.vscode-eslint

# linter for markdown
davidanson.vscode-markdownlint

# pair programming
# TODO: make this work offline or don't install it when offline
ms-vsliveshare.vsliveshare

# tests UI
hbenl.vscode-test-explorer

# tests status bar info
connorshea.vscode-test-explorer-status-bar

# tests UI over remote pair-programming session
hbenl.vscode-test-explorer-liveshare

# clipboard history
sirtobi.code-clip-ring

# live static HTTP server
ritwickdey.LiveServer

# remote development (SSH + WSL + Docker)
# TODO: make this work offline or don't install it when offline
ms-vscode-remote.vscode-remote-extensionpack

# spell checker
streetsidesoftware.code-spell-checker

# beautify HTML/CSS/JS/JSON
HookyQR.beautify

# TODO highlight
wayou.vscode-todo-highlight

# TODO file tree
gruntfuggly.todo-tree

# hex viewer
slevesque.vscode-hexdump

# vim emulator
vscodevim.vim

# set a different tint color for each window
johnpapa.vscode-peacock

# bookmark lines in files and jump to them
alefragnani.bookmarks

# auto-close HTML tags in HTML-like languages
formulahendry.auto-close-tag

# auto-rename matching HTML tag
formulahendry.auto-rename-tag

# highlight matching HTML tag
# TODO: is this really better than the built-in highlighting?
vincaslt.highlight-matching-tag

# debugger for Chrome
msjsdiag.debugger-for-chrome

# toggle ignoring node_modules on and off for when you want to find stuff in there
eamodio.toggle-excluded-files

# better markdown editing
# TODO: change default keybindings because they override built-in ones
yzhang.markdown-all-in-one

# live preview for HTML
daiyy.quick-html-previewer

# edit CSV files as tables
janisdd.vscode-edit-csv

# live preview Graphviz (dot) files
# NOTE: this is a fork of `stephanvs.dot` that seems to be more updated
EFanZh.graphviz-preview

# NPM package.json linter and NPM script runner
eg2.vscode-npm-script

# auto-complete NPM modules in import/require statements
christian-kohler.npm-intellisense

# run JS while typing
wallabyjs.quokka-vscode

# GitHub PRs
GitHub.vscode-pull-request-github

# open GitHub repo remotely
eamodio.remotehub

# open current file in remote VCS
ziyasal.vscode-open-in-github

# auto-completion powered by machine learning
# TODO: only install if there is internet
visualstudioexptteam.vscodeintellicode

# display Excel files
GrapeCity.gc-excelviewer

# display PDF files
tomoki1207.pdf


#################
### LANGUAGES ###
#################

# Python
ms-python.python

# C/C++
ms-vscode.cpptools

# C#
ms-vscode.csharp

# x86 assembly
13xforever.language-x86-64-assembly

# assembly
maziac.asm-code-lens

# Rust
kalitaalexey.vscode-rust

# Kotlin
# TODO: which is better? should i keep both?
fwcd.kotlin
mathiasfrohlich.Kotlin

# Java
redhat.java
# Java Debugger
vscjava.vscode-java-debug

# PowerShell
ms-vscode.powershell

# Dockerfile & docker-compose.yml
# this also adds docker commands
ms-azuretools.vscode-docker

# YAML
redhat.vscode-yaml

# vim script
dunstontc.viml

# fish shell script
skyapps.fish-vscode

# SVG
# this also adds a live preview
jock.svg

# Graphviz (dot)
joaompinto.vscode-graphviz

# Linker Script
ZixuanWang.linkerscript

# Windows Registry Script (.reg)
ionutvmi.reg
