# better Git integration
eamodio.gitlens

# ESLint integration
dbaeumer.vscode-eslint

# pair programming
ms-vsliveshare.vsliveshare

# live static HTTP server
ritwickdey.LiveServer

# Remote Development (SSH + WSL + Docker)
ms-vscode-remote.vscode-remote-extensionpack

# spell checker
streetsidesoftware.code-spell-checker

# beautify HTML/CSS/JS/JSON
HookyQR.beautify

# TODO highlight
wayou.vscode-todo-highlight

# hex viewer
slevesque.vscode-hexdump

# vim emulator
vscodevim.vim

# Auto-Close HTML Tags in HTML-like languages
formulahendry.auto-close-tag

# Auto-Rename HTML Pair Tag
formulahendry.auto-rename-tag

# live preview dot files
EFanZh.graphviz-preview

# edit CSV files as tables
janisdd.vscode-edit-csv

# open GitHub repo remotely
eamodio.remotehub

# GitHub PRs
GitHub.vscode-pull-request-github

# display Excel files
GrapeCity.gc-excelviewer

# display PDF files
tomoki1207.pdf


#################
### LANGUAGES ###
#################

# Python
ms-python.python

# C/C++
ms-vscode.cpptools

# C#
ms-vscode.csharp

# x86 assembly
13xforever.language-x86-64-assembly

# assembly
maziac.asm-code-lens

# Rust
kalitaalexey.vscode-rust

# Kotlin
mathiasfrohlich.Kotlin

# Java
redhat.java
# Java Debugger
vscjava.vscode-java-debug

# vim script
dunstontc.viml

# fish shell script
skyapps.fish-vscode

# Linker Script
ZixuanWang.linkerscript
