# Useful commands such as "sudo" and "shasum"
psutils

# NOTE: it's important that python3 comes after python2
# because they both add a "python" command and overwrite each other
python27
python

nodejs
git
git-filter-repo
7zip
wireshark
fiddler
graphviz
vlc
nasm
sqlite
rustup
kotlin-native
beyondcompare
sysinternals
winscp
spacesniffer
wabt
llvm
neovim
gitkraken
dotnet-sdk
sublime-text
wabt
mongodb
everything
virtualbox-np

paint.net
paintdotnet-plugin-pack-boltbait
paintdotnet-plugin-pack-pyrochild

# TODO: find a 32bit version to be able to open old .idb files, IDA free is 64bit and uses .i64 only
ida-free

# Docker Toolbox (installs docker client and docker-machine)
docker

# JDK + JRE
openjdk

# TODO: install Visual Studio Build Tools (for CL, Spy++, NMake, MSBuild)

windbg

adb

# TODO: the android-sdk package appears to be a bit broken
# find a way to make it work, or install the Android SDK, Android SDK Build Tools, and an emulator
# (https://developer.android.com/studio/index.html#command-tools)
# or give up and just install android-studio
#android-sdk

# pack and unpack Android APK files (doesn't decompile)
apktool

# TODO: consider for android reversing
#jadx
#dex2jar

# Java decompiler (the command is jd-cli)
jd-cmd
# C# decompiler
ilspy
# Flash decompiler
ffdec

# TODO: consider
#autohotkey
#gow / coreutils / grep
#clink

# x86 PC emulator
bochs

# Adobe Flash Player Projector (https://www.adobe.com/support/flashplayer/debug_downloads.html)
# to play flash games without a browser
flashplayer-sa

# PPSSPP - a PSP emulator
ppsspp

# a game emulator for several consoles
bizhawk

# AMIDST - Mincraft map explorer
amidst

# NBTExplorer - Minecraft world save explorer
nbtexplorer

# TODO: install GameMaker
# TODO: install Groupy
