pwsh
# TODO: GHCi for Haskell
nodejs
git
git-filter-repo
7zip
local/7zip-feature-add-to-context-menu
wireshark
fiddler
graphviz
vlc
nasm
sqlite
rustup
kotlin-native
beyondcompare
sysinternals
winscp
spacesniffer
wabt
llvm
neovim
gitkraken
dotnet-sdk
mongodb
everything
virtualbox-np
retools/cff-explorer
local/windbg
010editor
adb
nmap
vcxsrv

# Useful commands such as "sudo" and "shasum"
psutils

# Nushell
nu

less
sharpkeys
speedtest-cli

# NOTE: it's important that python3 comes after python2
# because they both add a "python" command and overwrite each other
python27
python
# allow applications and third-party installers to find python 3
local/python-feature-discoverable

sublime-text
local/sublime-text-feature-add-to-context-menu
local/sublime-text-feature-package-control

paint.net
paint.net-plugin-boltbait
paint.net-plugin-pyrochild
local/paintdotnet-plugin-codelab

# TODO: find a 32bit version to be able to open old .idb files, IDA free is 64bit and uses .i64 only
ida-free

# Docker Toolbox (installs docker client and docker-machine)
docker

# ffdec requires an old Java
oraclejre8
# JDK + JRE
# NOTE: it's important that the new java comes after the old one
# because they both change PATH and overwrite each other
openjdk

ripgrep

# install ffmpeg for the VSCode screen recorder extension Chronicler
ffmpeg

powertoys
# launcher search box
ueli
# 3D printing
cura

# pdf CLI tool
qpdf

# TODO: install Visual Studio Build Tools (for CL, Spy++, NMake, MSBuild)
# TODO: install MSDN?

# TODO: install source insight?

# TODO: install Android SDK, Android SDK Build Tools, an emulator
#       (https://developer.android.com/studio/index.html#command-tools)
#       or give up and just install `extras/android-studio`

# pack and unpack Android APK files (doesn't decompile)
apktool

# unpack and decompile android apk
jadx

# TODO: consider for android reversing
#dex2jar

# Java decompiler (the command is jd-cli)
jd-cmd
# C# decompiler
ilspy
# Flash decompiler
local/ffdec

# TODO: consider
#autohotkey
#gow / coreutils / grep
#clink

# x86 PC emulator
bochs

# Adobe Flash Player Projector (https://www.adobe.com/support/flashplayer/debug_downloads.html)
# to play flash games without a browser
flashplayer-sa

# a game emulator for several consoles
bizhawk

# PPSSPP - a PSP emulator
ppsspp

# AMIDST - Mincraft map explorer
amidst

# NBTExplorer - Minecraft world save explorer
nbtexplorer

# TODO: install GameMaker
# TODO: install Groupy
