main/pwsh
# TODO: GHCi for Haskell
main/nodejs
main/git
main/git-filter-repo
main/7zip
local/7zip-feature-add-to-context-menu
extras/wireshark
extras/fiddler
main/graphviz
extras/vlc
main/nasm
main/sqlite
main/rustup
main/kotlin-native
extras/beyondcompare
extras/sysinternals
extras/winscp
extras/spacesniffer
extras/wabt
main/llvm
main/neovim
extras/gitkraken
main/dotnet-sdk
main/mongodb
extras/everything
nonportable/virtualbox-np
retools/cff-explorer
local/windbg
extras/010editor
main/adb
main/nmap
extras/vcxsrv

# Useful commands such as "sudo" and "shasum"
main/psutils

# Nushell
main/nu

main/less
extras/sharpkeys
main/speedtest-cli

# NOTE: it's important that python3 comes after python2
# because they both add a "python" command and overwrite each other
versions/python27
main/python
# allow applications and third-party installers to find python 3
local/python-feature-discoverable

extras/sublime-text
local/sublime-text-feature-add-to-context-menu
local/sublime-text-feature-package-control

extras/paint.net
extras/paint.net-plugin-boltbait
extras/paint.net-plugin-pyrochild
local/paint.net-plugin-codelab

# TODO: find a 32bit version to be able to open old .idb files, IDA free is 64bit and uses .i64 only
extras/ida-free

# Docker Toolbox (installs docker client and docker-machine)
main/docker

# ffdec requires an old Java
java/oraclejre8
# JDK + JRE
# NOTE: it's important that the new java comes after the old one
# because they both change PATH and overwrite each other
java/openjdk

main/ripgrep

# install ffmpeg for the VSCode screen recorder extension Chronicler
main/ffmpeg

extras/powertoys
# launcher search box
extras/ueli
# 3D printing
extras/cura

# pdf CLI tool
main/qpdf

# TODO: install Visual Studio Build Tools (for CL, Spy++, NMake, MSBuild)
# TODO: install MSDN?

# TODO: install source insight?

# TODO: install Android SDK, Android SDK Build Tools, an emulator
#       (https://developer.android.com/studio/index.html#command-tools)
#       or give up and just install `extras/android-studio`

# pack and unpack Android APK files (doesn't decompile)
main/apktool

# unpack and decompile android apk
extras/jadx

# TODO: consider for android reversing
#retools/dex2jar

# Java decompiler (the command is jd-cli)
retools/jd-cmd
# C# decompiler
extras/ilspy
# Flash decompiler
extras/ffdec

# TODO: consider
#extras/autohotkey
#main/gow / main/coreutils / main/grep
#main/clink

# x86 PC emulator
main/bochs

# Adobe Flash Player Projector (https://www.adobe.com/support/flashplayer/debug_downloads.html)
# to play flash games without a browser
extras/flashplayer-sa

# a game emulator for several consoles
extras/bizhawk

# PPSSPP - a PSP emulator
games/ppsspp

# AMIDST - Mincraft map explorer
games/amidst

# NBTExplorer - Minecraft world save explorer
games/nbtexplorer

# TODO: install GameMaker
# TODO: install Groupy
